<?php
//面试技巧
/**
 * 面前准备及注意事项
 *      注意形象
 *          穿着得体
 *          注意言行举止
 *
 *      提前了解
 *          公司情况
 *          业务情况:
 *              入职后 我会做什么业务
 *
 *      充分准备
 *          自我介绍
 *          对所学知识点充分复习
 *          重点复习自己易犯的错误
 *          充分休息
 *
 * 注意事项
 *      遵守时间
 *          时间的重要性
 *              尽量不要提前太早到达，提前5分钟，切勿迟到
 *      言行举止
 *          谦虚谨慎、机智应变、扬长避短、显示潜能
 *      面试表现
 *          表现
 *              表情自然、面带微笑、不讲脏话、尊重对方
 *      面试忌讳
 *          忌讳
 *              不自信、小动作多、说话不清晰、对面试官不屑一顾、骄傲自大、
 *              跑题、说话啰嗦重复、过度热情
 *
 *
 *
 *
 */

