<?php
/**
 * 真题
 *      请简单描述一下数据结构的特征(stack, heap, list, doubly-linked-list,queue,array(vector))
 *
 * 考点
 *      常见数据结构特征的理解
 *
 * 常见数据结构
 *      Array
 *          数组，最简单而且应用最广泛的数据结构之一
 *          特性：使用连续的内存来存储、数组中国的所有元素必须是相同的类型或类型的衍生(同质数据结构)、元素可以通过下标直接访问。
 *
 *      LinkedList
 *          链表，线性表的一种，最基本、最简单，也是最常用的数据结构
 *          特性：元素之间的关系是一对一的关系(除了第一个和最后一个元素，其他元素都是收尾相接)、
 *                顺序存储结构和链式存储结构两种存储方式。
 *
 *      Stack
 *          栈，和队列相似。一个带有数据存储特性的数据结构
 *          特性：存储数据是先进后出的、栈只有一个出口，只能从栈顶部增加和移除元素
 *
 *      Heap
 *          堆，一般情况下，堆交二叉堆，近似完全二叉树的数据结构
 *          特性：子节点的键值或者索引总是小于它的父节点、每个节点的左右子树又是一个二叉堆、
 *                根节点最大的堆叫最大堆或者大根堆、最小的叫最小堆或者小根堆。
 *
 *      list
 *          线性表，由零个或多个数据元素组成的有限序列
 *          特性：线性表是一个序列、0个元素构成的线性表是空表、第一个元素无先驱、最后一个元素无后继、
 *                有长度，长度是元素个数，长度有限。
 *
 *      doubly-linked-list
 *          双向链表
 *          特性：每个元素都是一个对象，没个对象有一个关键字key和两个指针(next和prev)
 *
 *      queue
 *          队列
 *          特性：先进先出(FIFO)、并发中使用、可以安全将对象从一个任务传给另一个任务。
 *
 *      set
 *          集合
 *          特性：保存不重复元素
 *
 *      map
 *          字典
 *          特性：关联数组、也被叫做字典或者键值对
 *
 *      graph
 *          图
 *          特性：通常使用邻接矩阵和邻接表表示、前者易实现但是对于稀疏矩阵会浪费较多空间、
 *                后者使用链表的方式存储信息但是对于图搜索时间复杂度较高
 *
 *
 * 解题方法
 *      先理解每种数据结构的特征，有时会遇到让用php代码实现其中的数据结构，遇到此类题
 *      ，先理解该种数据结构的特征是什么，然后再实现，通常可以使用PHP的数组来模拟。
 *
 * 一网打尽
 *      用PHP实现双向队列
 *
 *
 *
 *
 */

