<?php
/**
 * 真题：
 *      PHP框架有哪些，你用过哪些？各自的优缺点是什么？
 *
 * 考点：
 *      PHP框架的差异和优缺点
 *
 * PHP框架的差异和优缺点
 *      Yaf框架
 *          Yaf使用PHP扩展的形式写的一个PHP框架，也就是以C语言为底层编写的
 *          ，性能上要比PHP代码写的框架要快一个数量级。
 *
 *          优点：
 *              执行效率高、轻量级框架、可扩展性抢
 *          缺点：
 *              高版本兼容性差、底层代码可读性差、需要安装扩展、功能单一，开发需要编写大量的插件
 *
 *      Yii2框架
 *          Yii2是一款非常优秀的通用Web后端框架，结构简单优雅、实用功能丰富、扩展性强、
 *          性能高是它最突出的优点。
 *
 *          缺点：
 *              学习成本较高
 *              相比Yaf，量级较重
 *
 *      常见框架特性
 *          根据自己的框架使用经验，理解所使用框架的特性
 *          例如：Yii2框架的路由配置等
 *
 * 解题方法
 *      此类题目中，说明的最好是自己真正用过的框架，最好结合自己的简历，简历当中提到的框架
 *      ，要着重准备，可以说说在开发过程中，你使用该框架最让你印象深刻的功能和特性，最好进
 *      行框架间的对比，展现你对PHP框架的理解，侧面说明你的开发经验。
 *
 * 一网打尽
 *      真题：
 *          Yii2框架如何实现数据的自动验证？
 *
 *
 *
 *
 */


