<?php
/**
 * 回顾真题
 *      请写出PHP权限控制修饰符
 * 考点：
 *      PHP的类权限控制修饰符
 *      延伸：面向对象的封装、继承和多态
 *      延伸：魔术方法
 *      延伸：设计模式
 *
 * PHP类权限控制修饰符
 *      public、protected、private
 *
 * 延伸考点：面向对象的封装
 *      成员访问权限
 *
 * 延伸考点：面向对象的继承
 *      单一继承：同时只能继承一个类，
 *      方法重写：
 *
 * 延伸考点：面向对象的多态
 *      抽象类的定义：类前面加abstruct,有抽象方法，必须定义成抽象类。如果没有抽象方法，也可以将类定义成抽象类
 *      接口的定义：方法都是抽象的 将类定义成interface。
 *
 * 延伸考点：魔术方法
 *      __construct()  类的构造函数
 *      __destruct() 类的析构函数
 *      __call()    在对象中调用一个不可访问方法时调用
 *      __callStatic()  用静态方式中调用一个不可访问方法时调用
 *      __get()   获得一个类的成员变量时调用
 *      __set()   设置一个类的成员变量时调用
 *      __isset()  当对不可访问属性调用isset()或empty()时调用
 *      __unset()  当对不可访问属性调用unset()时被调用。
 *      __sleep()  执行serialize()时，先会调用这个函数
 *      __wakeup()  执行unserialize()时，先会调用这个函数
 *      __toString() 类被当成字符串时的回应方法
 *      __clone()  当对象复制完成时调用
 *
 *  参考链接  PHP之十六个魔术方法详细介绍：https://www.jb51.net/article/96167.htm
 *
 *
 * 延伸考点：设计模式（大话设计模式）
 *      常见设计模式：工厂模式、单例模式、注册数模式、适配器模式、观察者模式和策略模式
 *
 * 解题方法
 *      着重记忆PHP面向对象的基本语法，记忆魔术方法，理解常见设计模式
 *
 * 一网打尽
 *      请写出PHP的构造函数和析构函数
 *      __construct()
 *      __destruct()
 *      方法名和类名保持一致的话，此方法也是构造方法
 *
 *
 *
 *
 */



